SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG28/Include/efr32fg28_lfxo.h
/**************************************************************************//**
 * @file
 * @brief EFR32FG28 LFXO register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2023 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32FG28_LFXO_H
#define EFR32FG28_LFXO_H
#define LFXO_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32FG28_LFXO LFXO
 * @{
 * @brief EFR32FG28 LFXO Register Declaration.
 *****************************************************************************/

/** LFXO Register Declaration. */
typedef struct {
  __IM uint32_t  IPVERSION;                     /**< LFXO IP version                                    */
  __IOM uint32_t CTRL;                          /**< LFXO Control Register                              */
  __IOM uint32_t CFG;                           /**< LFXO Configuration Register                        */
  uint32_t       RESERVED0[1U];                 /**< Reserved for future use                            */
  __IM uint32_t  STATUS;                        /**< LFXO Status Register                               */
  __IOM uint32_t CAL;                           /**< LFXO Calibration Register                          */
  __IOM uint32_t IF;                            /**< Interrupt Flag Register                            */
  __IOM uint32_t IEN;                           /**< Interrupt Enable Register                          */
  __IM uint32_t  SYNCBUSY;                      /**< LFXO Sync Busy Register                            */
  __IOM uint32_t LOCK;                          /**< Configuration Lock Register                        */
  uint32_t       RESERVED1[1014U];              /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_SET;                 /**< LFXO IP version                                    */
  __IOM uint32_t CTRL_SET;                      /**< LFXO Control Register                              */
  __IOM uint32_t CFG_SET;                       /**< LFXO Configuration Register                        */
  uint32_t       RESERVED2[1U];                 /**< Reserved for future use                            */
  __IM uint32_t  STATUS_SET;                    /**< LFXO Status Register                               */
  __IOM uint32_t CAL_SET;                       /**< LFXO Calibration Register                          */
  __IOM uint32_t IF_SET;                        /**< Interrupt Flag Register                            */
  __IOM uint32_t IEN_SET;                       /**< Interrupt Enable Register                          */
  __IM uint32_t  SYNCBUSY_SET;                  /**< LFXO Sync Busy Register                            */
  __IOM uint32_t LOCK_SET;                      /**< Configuration Lock Register                        */
  uint32_t       RESERVED3[1014U];              /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_CLR;                 /**< LFXO IP version                                    */
  __IOM uint32_t CTRL_CLR;                      /**< LFXO Control Register                              */
  __IOM uint32_t CFG_CLR;                       /**< LFXO Configuration Register                        */
  uint32_t       RESERVED4[1U];                 /**< Reserved for future use                            */
  __IM uint32_t  STATUS_CLR;                    /**< LFXO Status Register                               */
  __IOM uint32_t CAL_CLR;                       /**< LFXO Calibration Register                          */
  __IOM uint32_t IF_CLR;                        /**< Interrupt Flag Register                            */
  __IOM uint32_t IEN_CLR;                       /**< Interrupt Enable Register                          */
  __IM uint32_t  SYNCBUSY_CLR;                  /**< LFXO Sync Busy Register                            */
  __IOM uint32_t LOCK_CLR;                      /**< Configuration Lock Register                        */
  uint32_t       RESERVED5[1014U];              /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_TGL;                 /**< LFXO IP version                                    */
  __IOM uint32_t CTRL_TGL;                      /**< LFXO Control Register                              */
  __IOM uint32_t CFG_TGL;                       /**< LFXO Configuration Register                        */
  uint32_t       RESERVED6[1U];                 /**< Reserved for future use                            */
  __IM uint32_t  STATUS_TGL;                    /**< LFXO Status Register                               */
  __IOM uint32_t CAL_TGL;                       /**< LFXO Calibration Register                          */
  __IOM uint32_t IF_TGL;                        /**< Interrupt Flag Register                            */
  __IOM uint32_t IEN_TGL;                       /**< Interrupt Enable Register                          */
  __IM uint32_t  SYNCBUSY_TGL;                  /**< LFXO Sync Busy Register                            */
  __IOM uint32_t LOCK_TGL;                      /**< Configuration Lock Register                        */
} LFXO_TypeDef;
